{
  "COMP1511": {
    "description": "From recent innovations in AI like self-driving cars to humanoid robotics navigating complex environments, leapfrogs in battery technology to sequencing the human genome - the world is benefiting and evolving thanks to computer systems. At the core of all these systems are computers executing instructions to solve exciting problems.",
    "prerequisites": "None",
    "prereq_skills": ["None"],
    "assessment_timeline": {
      "week1": ["-"],
      "week2": ["Problem Set 1"],
      "week3": ["Problem Set 2"],
      "week4": ["Problem Set 3"],
      "week5": ["Assignment 1 Due", "Problem Set 4"],
      "week6": ["Problem Set 5"],
      "week7": ["Problem Set 6" ],
      "week8": ["Assignment 2 Due", "Problem Set 7"],
      "week9": ["Problem Set 8"],
      "week10": ["-"],
      "week11": ["-"]
    }
  },

  "COMP1521": {
    "description": "This course provides a programmer's view on how a computer system executes programs, manipulates data and communicates. It enables students to become effective programmers in dealing with issues of performance, portability, and robustness. It is typically taken in the term after completing COMP1511, but could be delayed and taken later. It serves as a foundation for later courses on networks, operating systems, computer architecture and compilers, where a deeper understanding of systems-level issues is required. Topics: Introduction to the systems-level view of computing, number representation, machine-level programming, representing high-level programs in machine code, memory, input/output, system architectures, operating systems, networks, parallelism/concurrency, communication/synchronisation. Labs and assignment work in C and machine code.",
    "prerequisites": "COMP1511 or DPST1091 or COMP1911 or COMP1917",
    "prereq_skills": [
      "Write simple programs in the C programming language",
      "Define and invoke functions and return results in C",
      "Define and manipulate structured data in C",
      "Use pointers to access data objects"
    ],
    "assessment_timeline": {
      "week1": ["-"],
      "week2": ["-"],
      "week3": ["Lab 1", "Lab 2", "Weekly Quiz 1"],
      "week4": ["Lab 3", "Weekly Quiz 2"],
      "week5": ["Assignment 1 Due", "Lab 4", "Weekly Quiz 3"],
      "week6": ["-"],
      "week7": ["Lab 5", "Weekly Quiz 4"],
      "week8": ["Assignment 2 Due", "Lab 6", "Weekly Quiz 5"],
      "week9": ["Lab 7", "Weekly Quiz 6" ],
      "week10": ["Lab 8", "Weekly Quiz 7"],
      "week11": ["-"]
    }
  },

  "COMP1531": {
    "description": "This course teaches students about software engineering principles via exposure to the important practice of building correct products in effectively functioning teams.\n\nYou will be exposed to agile software practices, team collaboration and effective communication through implementing a group project based on agile software methodologies that require you to analyse, design, build and deploy a web-based application. This course is typically taken soon after completing COMP1511 but could be delayed and taken later. It provides essential background for the teamwork and project management required in many later courses.",
    "prerequisites": "COMP1511 or DPST1091 or COMP1917 or COMP1921",
    "prereq_skills": [
      "Write simple programs in the C programming language",
      "Define and invoke functions and return results in C",
      "Define and manipulate structured data in C",
      "Use pointers to access data objects"
    ],
    "assessment_timeline": {
      "week1": ["-"],
      "week2": ["Iteration 0 Due", "Lab 1"],
      "week3": ["Lab 2"],
      "week4": ["Lab 3"],
      "week5": ["Iteration 1 Due", "Lab 4"],
      "week6": ["-"],
      "week7": ["Lab 5", "Lab 6"],
      "week8": ["Iteration 2 Due", "Lab 7"],
      "week9": ["Lab 8"],
      "week10": ["Iteration 3 Due", "Lab 9"],
      "week11": ["-"]
    }
  },

  "COMP2511": {
    "description": "COMP2511 builds on the foundation of first-year CSE courses, and begins to answer the questions: \"What does good software look like?\" and \"How do you build software that is flexible, reusable and maintainable\". The course introduces students to the Object-Oriented Programming paradigm and explores how OOP attempts to solve the problem of good software design. Students explore fundamental Software Patterns in designing, writing and testing software, and how to apply these strategies to both theoretical and real-world problems. The course also teaches an appreciation for elegantly written code, problem solving and finding well-designed solutions to problems that have longevity of software in mind.",
    "prerequisites": "COMP1531 AND (COMP2521 OR COMP1927)",
    "prereq_skills": [
      "Demonstrate an ability to analyse complex software systems in terms of their data model, state model, and more",
      "Demonstrate effective use of static testing, dynamic testing, and user testing to validate and verify software systems",
      "Describe and analyse fundamental data structures and algorithms",
      "Choose/develop appropriate algorithms to manipulate chosen data structures"
    ],
    "assessment_timeline": {
      "week1": ["-"],
      "week2": ["Lab 1"],
      "week3": ["Lab 2"],
      "week4": ["Lab 3"],
      "week5": ["Assignment 1 Due", "Lab 4"],
      "week6": ["-"],
      "week7": ["Lab 5"],
      "week8": ["Lab 6"],
      "week9": ["Assignment 2 Due", "Lab 7"],
      "week10": ["-"],
      "week11": ["(Optional) Assingment 3 Due"]
    }
  },

  "COMP2521": {
    "description": "The goal of this course is to deepen understanding of data structures and algorithms and how these can be employed effectively in the design of software systems. We anticipate that it will generally be taken in the second year of a program, but since its only pre-requisite is COMP1511, is it possible to take it in first year. It is an important course in covering a range of core data structures and algorithms that will be used in context in later courses.",
    "prerequisites": "COMP1511 or DPST1091 or COMP1917 or COMP1921",
    "prereq_skills": [
      "Write simple programs in the C programming language",
      "Define and invoke functions and return results in C",
      "Define and manipulate structured data in C",
      "Use pointers to access data objects"
    ],
    "assessment_timeline": {
      "week1": ["-"],
      "week2": ["Lab 1", "Quiz 1"],
      "week3": ["Lab 2", "Quiz 2"],
      "week4": ["Lab 3", "Quiz 3"],
      "week5": ["Assignment 1 Due", "Lab 4", "Quiz 4"],
      "week6": ["-"],
      "week7": ["Lab 5", "Quiz 5"],
      "week8": ["Assignment 2 Due", "Lab 6", "Quiz 6"],
      "week9": ["Lab 7", "Quiz 7"],
      "week10": ["Lab 8", "Quiz 8"],
      "week11": ["-"]
    }
  }
}